1.
a=1 			- присвоили целочисленное значение
b=2 			- присвоили целочисленное значение
c=a+b 			- присвоили переменной с строку а+b 
d=$a+$b 		- тут мы раскрыли значения переменных a и b, получили d = 1+2
e=$(($a+$b))	- тут мы выполняем математическую операцию стработает и вот в таком виде e=$((a+b))
2. 2.sh - необходимо было добавить brake
3. 3.sh - сделал что бы опрашивало поочереди
4. 4.sh 
5. Как я понял тут нужна регулярка? Которая до знака - проверяет что это цифры и вторая чать проверяет кол-во символов?
